tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
        }
}

static bool is_valid_wifi_text(const char *text, size_t max_len)
{
    size_t len = 0;

    if (text == NULL || text[0] == '\0') {
        return false;
    }
    len = strlen(text);
    return len > 0 && len < max_len;
}

static esp_err_t save_wifi_config_to_nvs(const char *ssid, const char *password)
{
    nvs_handle_t handle = 0;

    if (!is_valid_wifi_text(ssid, 33) || password == NULL || strlen(password) >= 65) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t ret = nvs_open("nvs.net80211", NVS_READWRITE, &handle);
    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "open nvs.net80211 failed: %s", esp_err_to_name(ret));
        return ret;
    }

    ret = nvs_set_blob(handle, "sta.ssid", ssid, strlen(ssid) + 1);
    if (ret == ESP_OK) {
        ret = nvs_set_blob(handle, "sta.pswd", password, strlen(password) + 1);
    }
    if (ret == ESP_OK) {
        ret = nvs_commit(handle);
    }
    nvs_close(handle);

    if (ret != ESP_OK) {
        ESP_LOGE(TAG, "WiFi config save failed ret=%s", esp_err_to_name(ret));
    }
    return ret;
}

class SsidManager {
public:
    static SsidManager& GetInstance()
    {
        static SsidManager instance;
        return instance;
    }

    void Clear()
    {
        nvs_handle_t nvs_handle = 0;
        esp_err_t ret = nvs_open("wifi", NVS_READWRITE, &nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "SsidManager Clear open wifi failed: %s", esp_err_to_name(ret));
            return;
        }

        for (int i = 0; i < 10; i++) {
            char ssid_key[16];
            char password_key[16];
            if (i == 0) {
                snprintf(ssid_key, sizeof(ssid_key), "ssid");
                snprintf(password_key, sizeof(password_key), "password");
            } else {
                snprintf(ssid_key, sizeof(ssid_key), "ssid%d", i);
                snprintf(password_key, sizeof(password_key), "password%d", i);
            }
            (void)nvs_erase_key(nvs_handle, ssid_key);
            (void)nvs_erase_key(nvs_handle, password_key);
        }
        ret = nvs_commit(nvs_handle);
        nvs_close(nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGW(TAG, "SsidManager Clear failed: %s", esp_err_to_name(ret));
        }
    }

    esp_err_t AddSsid(const std::string& ssid, const std::string& password)
    {
        nvs_handle_t nvs_handle = 0;
        esp_err_t ret = nvs_open("wifi", NVS_READWRITE, &nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "SsidManager AddSsid open wifi failed: %s", esp_err_to_name(ret));
            return ret;
        }

        ret = nvs_set_str(nvs_handle, "ssid", ssid.c_str());
        if (ret == ESP_OK) {
            ret = nvs_set_str(nvs_handle, "password", password.c_str());
        }
        if (ret == ESP_OK) {
            ret = nvs_commit(nvs_handle);
        }
        nvs_close(nvs_handle);
        if (ret != ESP_OK) {
            ESP_LOGE(TAG, "SsidManager AddSsid failed: %s", esp_err_to_name(ret));
        }
        return ret;
    }
};

class WifiConfigurationAp {
public:
    static WifiConfigurationAp& GetInstance()
    {
        static WifiConfigurationAp instance;
        return instance;
    }

    esp_err_t Save(const std::string& ssid, const std::string& password)
    {
        esp_err_t wifi_ret = SsidManager::GetInstance().AddSsid(ssid, password);
        esp_err_t sta_ret = save_wifi_config_to_nvs(ssid.c_str(), password.c_str());
        return wifi_ret != ESP_OK ? wifi_ret : sta_ret;
    }
};

static TaskHandle_t s_wifi_connect_task = NULL;
static json_sender_t s_wifi_connect_reply_sender = NULL;
static bool s_wifi_connect_notify_result = false;
static const char *s_wifi_connect_result_func = NULL;
static bool s_wifi_connect_force_reconnect = false;
static uint8_t check_net_state(void);

static void wifi_connect_task(void *arg)
{
    (void)arg;
    bool force_reconnect = s_wifi_connect_force_reconnect;
    uint8_t init_result = force_reconnect
                              ? ::User_Network_mode_app_init_force("/data")
                              : ::User_Network_mode_app_init("/data");
    int connect_result = ServerNetworkSta_GetLastConnectResult();
    ESP_LOGI(TAG, "BLE/CH583 WiFi connect task finished init=%u connect_result=%d",
             (unsigned int)init_result,
             connect_result);
    json_sender_t reply_sender = s_wifi_connect_reply_sender;
    bool notify_result = s_wifi_connect_notify_result;
    const char *result_func = s_wifi_connect_result_func != NULL
                                  ? s_wifi_connect_result_func
                                  : "wifi_wakeup_result";
    s_wifi_connect_reply_sender = NULL;
    s_wifi_connect_notify_result = false;
    s_wifi_connect_result_func = NULL;
    s_wifi_connect_force_reconnect = false;
    if (notify_result && reply_sender != NULL) {
        s_active_send_json = reply_sender;
        if (connect_result == TDX_JSON_RESULT_OK && check_net_state() != 0) {
            send_base_info_to_mobile();
        } else if (connect_result == TDX_JSON_RESULT_WIFI_AUTH_FAILED) {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_AUTH_FAILED,
                                           "WiFi authentication failed");
        } else if (connect_result == TDX_JSON_RESULT_WIFI_GOT_IP_FAILED) {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_GOT_IP_FAILED,
                                           "WiFi did not obtain IP");
        } else {
            send_simple_result_with_sender(reply_sender,
                                           result_func,
                                           TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                           "WiFi connect timed out");
        }
    }
    WiFi_config_from_ch583 = false;
    WiFi_config_from_ble = false;
    s_wifi_connect_task = NULL;
    vTaskDelete(NULL);
}

