tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
static esp_err_t submit_wifi_connect(json_sender_t reply_sender,
                                     bool notify_result,
                                     const char *result_func,
                                     bool force_reconnect)
{
    if (s_wifi_connect_task != NULL) {
        return ESP_ERR_INVALID_STATE;
    }
    s_wifi_connect_reply_sender = reply_sender;
    s_wifi_connect_notify_result = notify_result;
    s_wifi_connect_result_func = result_func;
    s_wifi_connect_force_reconnect = force_reconnect;
    if (xTaskCreate(wifi_connect_task,
                    "ble_wifi_connect",
                    6144,
                    NULL,
                    4,
                    &s_wifi_connect_task) != pdPASS) {
        s_wifi_connect_reply_sender = NULL;
        s_wifi_connect_notify_result = false;
        s_wifi_connect_result_func = NULL;
        s_wifi_connect_force_reconnect = false;
        return ESP_ERR_NO_MEM;
    }
    return ESP_OK;
}

static uint8_t check_net_state(void)
{
    server_network_sta_status_t status = {};
    return ServerNetworkSta_GetStatus(&status) == ESP_OK &&
                   status.state == SERVER_NETWORK_STA_STATE_GOT_IP &&
                   status.ip[0] != '\0'
               ? 1
               : 0;
}

int parse_wifi_config_json(const char *json_str, wifi_config_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;
    cJSON *item_ssid = NULL;
    cJSON *item_key = NULL;
    char reply_json[160];

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    /* 涓枃娉ㄩ噴锛?      鍏堟竻绌鸿緭鍑虹粨鏋勪綋锛岄伩鍏嶆畫鐣欐棫鏁版嵁    */
    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    item_func = cJSON_GetObjectItem(root, "func");
    item_ssid = cJSON_GetObjectItem(root, "ssid");
    item_key = cJSON_GetObjectItem(root, "key");

    /* 涓枃娉ㄩ噴锛?      妫€鏌ュ瓧娈垫槸鍚﹀瓨鍦ㄤ笖鏄瓧绗︿覆    */

    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL ||
        !cJSON_IsString(item_ssid) || item_ssid->valuestring == NULL ||
        !cJSON_IsString(item_key) || item_key->valuestring == NULL) {
        cJSON_Delete(root);
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    /* 涓枃娉ㄩ噴锛?
       瀹夊叏鎷疯礉鍒拌緭鍑虹粨鏋勪綋
    */
    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);
    snprintf(out->ssid, sizeof(out->ssid), "%s", item_ssid->valuestring);
    snprintf(out->key, sizeof(out->key), "%s", item_key->valuestring);

    cJSON_Delete(root);
    Bl_Data_Ready =1;

    // Keep this scope local; s_wifi_connect_task is the single BLE/CH583 BUSY guard.
    {
            if (s_wifi_connect_task != NULL) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_BUSY,
                                               "WiFi connect already in progress");
                return 0;
            }
            auto& wifi_ap = WifiConfigurationAp::GetInstance();
            std::string wifi_ssid = out->ssid;
            std::string wifi_password = out->key;
            // 3. 鎶婄粨鏋勪綋鐨勫€煎杩?JSON            
            snprintf(reply_json, sizeof(reply_json),
                     "{\"func\":\"wifi_result\",\"result\":%d,\"message\":\"Find wifi\",\"stage\":\"%s\"}",
                     TDX_JSON_RESULT_OK,
                     wifi_cfg.ssid);

            #if(USER_BLE_ENABLE == 1)
             (void)reply_json;
            // 杈撳嚭缁撴灉
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)reply_json;
            #endif

            UserDebugOutput_Printf("The Wifi info parsed ok, save to NVS\n\r");
            SsidManager::GetInstance().Clear();
            esp_err_t save_ret = wifi_ap.Save(wifi_ssid, wifi_password);
            if (save_ret != ESP_OK) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               TDX_JSON_RESULT_WIFI_SAVE_FAILED,
                                               "save WiFi config failed");
                return 0;
            }

            ServerNetworkSta_RequestProvisioning();
            esp_err_t submit_ret = submit_wifi_connect(s_active_send_json, true, "wifi_result", true);
            if (submit_ret != ESP_OK) {
                send_simple_result_with_sender(s_active_send_json,
                                               "wifi_result",
                                               submit_ret == ESP_ERR_INVALID_STATE
                                                   ? TDX_JSON_RESULT_BUSY
                                                   : TDX_JSON_RESULT_WIFI_CONNECT_SUBMIT_FAILED,
                                               "submit WiFi connect failed");
                return 0;
            }

            WiFi_config_net = true;
            Wifi_connect_OK = 1;
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_result",
                                           TDX_JSON_RESULT_OK,
                                           "WiFi config saved and connect submitted");

            //LOG_Purple("esp_restart .. %s>%d",__func__,__LINE__);
            //vTaskDelay(pdMS_TO_TICKS(1000));                    
            //esp_restart();                            // Restart device to apply new WiFi configuration
    }
    return 0;
}

int parse_wifi_wakeup_json(const char *json_str, wifi_config_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    
    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
        LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

