tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
    item_func = cJSON_GetObjectItem(root, "func");

    
    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL) {
        cJSON_Delete(root);
        LOG_ERROR("xxInvalid JSON");
        return -1;
    }

    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);
    if (strcmp(out->func, "wifi_wakeup") == 0) {
        UserDebugOutput_Printf("wakeup-ok\r\n");
    }
    else
    {
        UserDebugOutput_Printf("wakeup-fail\r\n");
        return -1;
    }
    cJSON_Delete(root);
    server_network_sta_status_t status = {};
    (void)ServerNetworkSta_GetStatus(&status);
    if (status.state == SERVER_NETWORK_STA_STATE_GOT_IP && status.ip[0] != '\0')
    {
       send_base_info_to_mobile();      
    }
    else if (status.state == SERVER_NETWORK_STA_STATE_CONNECTING)
    {
        char reply_json[192];
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"WiFi connection already in progress\",\"stage\":\"connecting\"}",
                 TDX_JSON_RESULT_OK);
        (void)s_active_send_json(reply_json);
    }
    else if (!ble_has_saved_wifi_info()) {
        ESP_LOGW(TAG, "No saved WiFi credential");
        char reply_json[160];
        snprintf(reply_json, sizeof(reply_json),
                    "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"wakeup No-WiFi\",\"stage\":\"error\"}",
                    TDX_JSON_RESULT_BLE_NO_SAVED_WIFI);

            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
                // 杈撳嚭缁撴灉
                UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
    }
    else {
        esp_err_t submit_ret = submit_wifi_connect(s_active_send_json, true, "wifi_wakeup_result", false);
        if (submit_ret == ESP_OK) {
            char reply_json[192];
            snprintf(reply_json, sizeof(reply_json),
                     "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"WiFi wakeup submitted\",\"stage\":\"connecting\"}",
                     TDX_JSON_RESULT_OK);
            (void)s_active_send_json(reply_json);
        } else if (submit_ret == ESP_ERR_INVALID_STATE) {
            char reply_json[192];
            snprintf(reply_json, sizeof(reply_json),
                     "{\"func\":\"wifi_wakeup_result\",\"result\":%d,\"message\":\"WiFi connection already in progress\",\"stage\":\"connecting\"}",
                     TDX_JSON_RESULT_OK);
            (void)s_active_send_json(reply_json);
        } else {
            send_simple_result_with_sender(s_active_send_json,
                                           "wifi_wakeup_result",
                                           TDX_JSON_RESULT_WIFI_CONNECT_TIMEOUT,
                                           "WiFi wakeup submit failed");
        }
    }

    return 0;
}

int parse_wifi_work_time_json(const char *json_str, wifi_work_time_json_t *out)
{
    cJSON *root = NULL;
    cJSON *item_func = NULL;
    cJSON *item_seconds = NULL;
    cJSON *item_time = NULL;
    cJSON *item_duration = NULL;
    char reply_json[160];
    esp_err_t set_ret = ESP_OK;

    if (json_str == NULL || out == NULL) {
        LOG_ERROR("Invalid parameter");
        return -1;
    }

    memset(out, 0, sizeof(*out));

    root = cJSON_Parse(json_str);
    if (root == NULL) {
        LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    item_func = cJSON_GetObjectItem(root, "func");
    item_seconds = cJSON_GetObjectItem(root, "seconds");
    item_time = cJSON_GetObjectItem(root, "time");

    if (!cJSON_IsString(item_func) || item_func->valuestring == NULL) {
        cJSON_Delete(root);
                LOG_Purple("%s>%d  Invalid JSON",__func__,__LINE__);
        return -1;
    }

    snprintf(out->func, sizeof(out->func), "%s", item_func->valuestring);

    if (strcmp(out->func, "set_wifi_work_time") != 0 && strcmp(out->func, "wifi_standby") != 0) {
        cJSON_Delete(root);
        return -1;
    }

    item_duration = cJSON_IsNumber(item_seconds) ? item_seconds : item_time;
    if (!cJSON_IsNumber(item_duration)) {
        cJSON_Delete(root);
        LOG_ERROR("set_wifi_work_time JSON missing seconds/time");
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 TDX_JSON_RESULT_WIFI_WORK_TIME_MISSING);
            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
        return 0;
    }

    if (item_duration->valueint < SERVER_NETWORK_STA_WIFI_WORK_TIME_MIN_SECONDS ||
        item_duration->valueint > SERVER_NETWORK_STA_WIFI_WORK_TIME_MAX_SECONDS) {
        cJSON_Delete(root);
        LOG_ERROR("set_wifi_work_time JSON invalid");
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 TDX_JSON_RESULT_WIFI_WORK_TIME_RANGE);
            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif
        return 0;
    }

    out->seconds = item_duration->valueint;
    set_ret = ServerNetworkStaWifiWorkTime_SetAndSave((uint32_t)out->seconds);
    cJSON_Delete(root);

    if (set_ret == ESP_OK) {
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d}",
                 TDX_JSON_RESULT_OK);
    } else {
        snprintf(reply_json, sizeof(reply_json),
                 "{\"func\":\"set_wifi_work_time_result\",\"result\":%d,\"message\":\"set wifi work time failed\"}",
                 set_ret == ESP_ERR_INVALID_STATE
                     ? TDX_JSON_RESULT_WIFI_WORK_TIME_APPLY_FAILED
                     : TDX_JSON_RESULT_WIFI_WORK_TIME_SAVE_FAILED);
    }

            #if(USER_BLE_ENABLE == 1)
             (void)s_active_send_json(reply_json);
             UserDebugOutput_Printf("JSON:\n%s\n", reply_json);
            #else
             (void)s_active_send_json(reply_json);
            #endif

