tdxguiping/ESP32_S3_epaper/main/ble/ble_data_handler.cpp
    return 0;
}

static void handle_wifi_json_text_with_sender(const char *json_text,
                                              json_sender_t send_json,
                                              bool reply_to_ch583)
{
    if (json_text == NULL || json_text[0] == '\0') {
        send_simple_result_with_sender(send_json, "ble_json_result", TDX_JSON_RESULT_BLE_JSON_EMPTY, "empty json");
        return;
    }

    ESP_LOGI(TAG, "RX JSON ch583=%d: %s", reply_to_ch583 ? 1 : 0, json_text);

    cJSON *root = cJSON_Parse(json_text);
    if (root == NULL) {
        send_simple_result_with_sender(send_json,
                                       "ble_json_result",
                                       TDX_JSON_RESULT_BLE_JSON_PARSE_FAILED,
                                       "invalid json");
        return;
    }
    cJSON *func_item = cJSON_GetObjectItemCaseSensitive(root, "func");
    if (!cJSON_IsString(func_item) || func_item->valuestring == NULL) {
        cJSON_Delete(root);
        send_simple_result_with_sender(send_json,
                                       "ble_json_result",
                                       TDX_JSON_RESULT_BLE_FUNC_UNSUPPORTED,
                                       "missing func");
        return;
    }

    char func[32];
    strlcpy(func, func_item->valuestring, sizeof(func));
    if (strcmp(func, "wifi") == 0) {
        cJSON *ssid_item = cJSON_GetObjectItemCaseSensitive(root, "ssid");
        cJSON *key_item = cJSON_GetObjectItemCaseSensitive(root, "key");
        int validation_result = TDX_JSON_RESULT_OK;
        const char *validation_message = NULL;
        if (ssid_item == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_SSID_MISSING;
            validation_message = "ssid missing";
        } else if (key_item == NULL) {
            validation_result = TDX_JSON_RESULT_WIFI_KEY_MISSING;
            validation_message = "key missing";
        } else if (!cJSON_IsString(ssid_item) || ssid_item->valuestring == NULL ||
                   !is_valid_wifi_text(ssid_item->valuestring, 33)) {
            validation_result = TDX_JSON_RESULT_WIFI_SSID_INVALID;
            validation_message = "ssid invalid";
        } else if (!cJSON_IsString(key_item) || key_item->valuestring == NULL ||
                   strlen(key_item->valuestring) >= 65) {
            validation_result = TDX_JSON_RESULT_WIFI_KEY_INVALID;
            validation_message = "key invalid";
        }
        if (validation_result != TDX_JSON_RESULT_OK) {
            cJSON_Delete(root);
            send_simple_result_with_sender(send_json,
                                           "wifi_result",
                                           validation_result,
                                           validation_message);
            return;
        }
    }
    cJSON_Delete(root);
    s_active_send_json = send_json;

    if (reply_to_ch583) {
        WiFi_config_from_ch583 = true;
    } else {
        WiFi_config_from_ble = true;
    }
    if (strcmp(func, "wifi") == 0 && parse_wifi_config_json(json_text, &wifi_cfg) == 0) {
        UserDebugOutput_Printf("ssid=%s\n", wifi_cfg.ssid);
        return;
    }
    if (reply_to_ch583) {
        WiFi_config_from_ch583 = false;
    } else {
        WiFi_config_from_ble = false;
    }
    if (strcmp(func, "wifi_wakeup") == 0 && parse_wifi_wakeup_json(json_text, &wifi_cfg) == 0) {
        UserDebugOutput_Printf("wakeup ok\r\n");
        return;
    }
    if ((strcmp(func, "set_wifi_work_time") == 0 || strcmp(func, "wifi_standby") == 0) &&
        parse_wifi_work_time_json(json_text, &wifi_work_time_cfg) == 0) {
        UserDebugOutput_Printf("func=%s\n", wifi_work_time_cfg.func);
        UserDebugOutput_Printf("seconds=%d\n", wifi_work_time_cfg.seconds);
        return;
    }

    send_simple_result_with_sender(send_json, "ble_json_result", TDX_JSON_RESULT_BLE_FUNC_UNSUPPORTED, "unsupported func");
}

void User_HandleWifiJsonText(const char *json_text)
{
    handle_wifi_json_text_with_sender(json_text, ble_send_json, false);
}

void User_HandleWifiJsonTextFromCh583(const char *json_text)
{
    handle_wifi_json_text_with_sender(json_text, ch583_send_json, true);
}

#if USER_BLE_ENABLE
static void User_HandleWifiJsonBytes(const uint8_t *json_data, uint16_t json_len)
{
    char json_text[USER_BLE_JSON_BUF_SIZE + 1];
    size_t copy_len = json_len;

    if (json_data == NULL || json_len == 0) {
        User_HandleWifiJsonText("");
        return;
    }
    if (copy_len > USER_BLE_JSON_BUF_SIZE) {
        copy_len = USER_BLE_JSON_BUF_SIZE;
    }

    memcpy(json_text, json_data, copy_len);
    json_text[copy_len] = '\0';
    User_HandleWifiJsonText(json_text);
}

static void User_BleWriteTask(void *arg)
{
    (void)arg;

    while (true) {
        user_ble_write_msg_t *msg = NULL;
        if (xQueueReceive(s_ble_write_queue, &msg, portMAX_DELAY) != pdTRUE) {
            continue;
        }
        if (msg != NULL) {
            User_HandleWifiJsonBytes(msg->data, msg->len);
            free(msg);
        }
    }
}

esp_err_t UserBleDataHandler_Init(void)
{
    if (s_ble_write_queue == NULL) {
        s_ble_write_queue = xQueueCreate(USER_BLE_WRITE_QUEUE_LENGTH, sizeof(user_ble_write_msg_t *));
        if (s_ble_write_queue == NULL) {
            ESP_LOGE(TAG, "create BLE write queue failed");
            return ESP_ERR_NO_MEM;
        }
    }

    if (s_ble_write_task == NULL) {
        BaseType_t ret = xTaskCreate(User_BleWriteTask,
                                     "ble_write",
                                     USER_BLE_WRITE_TASK_STACK_SIZE,
                                     NULL,
                                     USER_BLE_WRITE_TASK_PRIORITY,
                                     &s_ble_write_task);
        if (ret != pdPASS) {
            ESP_LOGE(TAG, "create BLE write task failed");
            return ESP_ERR_NO_MEM;
        }
    }

    ESP_LOGI(TAG, "BLE data handler ready queue=%d json_max=%d",
             USER_BLE_WRITE_QUEUE_LENGTH, USER_BLE_JSON_BUF_SIZE);
    return ESP_OK;
}

esp_err_t User_QueueBleWriteBytes(const uint8_t *data, uint16_t len)
{
    if (data == NULL || len == 0) {
        ESP_LOGW(TAG, "BLE write empty");
        return ESP_ERR_INVALID_ARG;
    }
    if (s_ble_write_queue == NULL) {
        ESP_LOGW(TAG, "BLE write queue not ready");
        return ESP_ERR_INVALID_STATE;
    }

    user_ble_write_msg_t *msg = (user_ble_write_msg_t *)calloc(1, sizeof(user_ble_write_msg_t));
    if (msg == NULL) {
        ESP_LOGE(TAG, "alloc BLE write msg failed len=%u", (unsigned int)len);
        return ESP_ERR_NO_MEM;
    }

    msg->len = len > USER_BLE_JSON_BUF_SIZE ? USER_BLE_JSON_BUF_SIZE : len;
    memcpy(msg->data, data, msg->len);

    if (xQueueSend(s_ble_write_queue, &msg, 0) != pdTRUE) {
        ESP_LOGW(TAG, "BLE write queue full, drop len=%u", (unsigned int)msg->len);
        free(msg);
        return ESP_ERR_TIMEOUT;
    }

    ESP_LOGI(TAG, "BLE write queued len=%u", (unsigned int)msg->len);
    return ESP_OK;
}
#else
esp_err_t UserBleDataHandler_Init(void)
{
    ESP_LOGI(TAG, "BLE data handler disabled by USER_BLE_ENABLE=0");
    return ESP_OK;
}

esp_err_t User_QueueBleWriteBytes(const uint8_t *data, uint16_t len)
{
    (void)data;
    (void)len;
    return ESP_ERR_NOT_SUPPORTED;
}
#endif
